import React from "react";
import Faq from "react-faq-component";
import { MdEmail } from "react-icons/md";
import { FaPhoneAlt } from "react-icons/fa";

const FaqComponent = () => {
  const data = {
    title: "الاسئلة الاكثر شيوعاً :",
    rows: [
      {
        title: " كم هي مده التوصيل لشحنات الطيران ؟",
        content: `المده تتراوح مابين ال ٧ - ١٠ ايام عمل ، هذه المذه شامله التخليص الجمركي و الافراجات من الهيئه العامه للجمارك.`,
      },
      {
        title: "كم هي مده التوصيل للشحن البحري ؟",
        content:
          "المده تتراوح مابين ال ٤٠-٤٥ يوم من وقت تحميل الشحنه بالكونتينر في مستودعاتنا في الصين، المده شامله التخليص الجمركي و افراجات من الهيئه العامه للجمارك.",
      },
      {
        title: "هل يمكنكم ان تستلموا الشحنه من مستودعات المصنع ؟",
        content: `- للاسف، يجب على المصنع العمل باليه النقل الداخلي الى مستودعاتنا في الصين، و وضع العلامه المخصصه لكم على الكراتين من الخارج لكي يتم ادراجها في السستم الخاص بنا لتتبع الشحنه، بامكانك التواصل مع خدمه العملاء على ارقامنا في الواتساب للحصول على عنوان المستودع و الكود الخاص بك.`,
      },
      {
        title: " ما هي الممنوعات في الشحن ؟",
        content: (
          <p>
            - نحن نتبع سياسه الممنوعات المدرجه في جميع البلدان التي نعمل بها،
            وفقا للوائح الممنوعات في الهيئه العامه للجمارك للبلد المقيم بها،
            بامكانك مراجعه لوائح الممنوعات بالنقر على هذا الرابط.
          </p>
        ),
      },
      {
        title: "هل تتعاملون مع الشحنات الشخصيه ؟",
        content: `للاسف، نتعامل فقط مع الشحنات التجاريه الي لا تقل عن ربع متر مكعب في ال الشحن البحري، و ١٠ كيلوغرام في حال الشحن عن طريق الطيران. `,
      },
      {
        title: "ما هي اقل كميات للشحن عن طريق البحري او الطيران ؟",
        content: `اقل كميه للشحن عن طريق الطيران هي ١٠ كغ، اما عن طريق البحر فهي ربع متر مكعب CBM.`,
      },
    ],
  };

  return (
    <div className="ml-3">
      <Faq
        data={data}
        styles={{}}
        config={{
          tabFocus: true,
        }}
      />
    </div>
  );
};

export default FaqComponent;
